bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G484xx.svd
         </registers>
      </peripheral>	  	  	
      <peripheral>
         <name>SYSCFG</name>
         <description>System configuration controller</description>
         <groupName>SYSCFG</groupName>
         <baseAddress>0x40010000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x2A</size>
            <usage>registers</usage>
         </addressBlock>             
     <registers>
            <register>
               <name>MEMRMP</name>
               <displayName>MEMRMP</displayName>
               <description>Remap Memory register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEM_MODE</name>
                     <description>Memory mapping selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FB_mode</name>
                     <description>User Flash Bank mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR1</name>
               <displayName>CFGR1</displayName>
               <description>peripheral mode configuration           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7C000001</resetValue>
               <fields>
                  <field>
                     <name>BOOSTEN</name>
                     <description>BOOSTEN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANASWVDD</name>
                     <description>GPIO analog switch control voltage               selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB6_FMP</name>
                     <description>FM+ drive capability on               PB6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB7_FMP</name>
                     <description>FM+ drive capability on               PB6</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB8_FMP</name>
                     <description>FM+ drive capability on               PB6</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C_PB9_FMP</name>
                     <description>FM+ drive capability on               PB6</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1_FMP</name>
                     <description>I2C1 FM+ drive capability               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2_FMP</name>
                     <description>I2C1 FM+ drive capability               enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3_FMP</name>
                     <description>I2C1 FM+ drive capability               enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C4_FMP</name>
                     <description>I2C1 FM+ drive capability               enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPU_IE</name>
                     <description>FPU Interrupts Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR1</name>
               <displayName>EXTICR1</displayName>
               <description>external interrupt configuration register           1</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI3</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI2</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI1</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI0</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR2</name>
               <displayName>EXTICR2</displayName>
               <description>external interrupt configuration register           2</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI7</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI6</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI5</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI4</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR3</name>
               <displayName>EXTICR3</displayName>
               <description>external interrupt configuration register           3</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI11</name>
                     <description>EXTI x configuration (x = 8 to               11)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI10</name>
                     <description>EXTI10</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI9</name>
                     <description>EXTI x configuration (x = 8 to               11)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI8</name>
                     <description>EXTI x configuration (x = 8 to               11)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR4</name>
               <displayName>EXTICR4</displayName>
               <description>external interrupt configuration register           4</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI15</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI14</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI13</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI12</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCSR</name>
               <displayName>SCSR</displayName>
               <description>CCM SRAM control and status           register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCMER</name>
                     <description>CCM SRAM Erase</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CCMBSY</name>
                     <description>CCM SRAM busy by erase operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <displayName>CFGR2</displayName>
               <description>configuration register 2</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLL</name>
                     <description>Core Lockup Lock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPL</name>
                     <description>SRAM Parity Lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PVDL</name>
                     <description>PVD Lock</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECCL</name>
                     <description>ECC Lock</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPF</name>
                     <description>SRAM Parity Flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWPR</name>
               <displayName>SWPR</displayName>
               <description>SRAM Write protection register           1</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Page0_WP</name>
                     <description>Write protection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page1_WP</name>
                     <description>Write protection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page2_WP</name>
                     <description>Write protection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page3_WP</name>
                     <description>Write protection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page4_WP</name>
                     <description>Write protection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page5_WP</name>
                     <description>Write protection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page6_WP</name>
                     <description>Write protection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page7_WP</name>
                     <description>Write protection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page8_WP</name>
                     <description>Write protection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page9_WP</name>
                     <description>Write protection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page10_WP</name>
                     <description>Write protection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page11_WP</name>
                     <description>Write protection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page12_WP</name>
                     <description>Write protection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page13_WP</name>
                     <description>Write protection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page14_WP</name>
                     <description>Write protection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page15_WP</name>
                     <description>Write protection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page16_WP</name>
                     <description>Write protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page17_WP</name>
                     <description>Write protection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page18_WP</name>
                     <description>Write protection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page19_WP</name>
                     <description>Write protection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page20_WP</name>
                     <description>Write protection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page21_WP</name>
                     <description>Write protection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page22_WP</name>
                     <description>Write protection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page23_WP</name>
                     <description>Write protection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page24_WP</name>
                     <description>Write protection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page25_WP</name>
                     <description>Write protection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page26_WP</name>
                     <description>Write protection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page27_WP</name>
                     <description>Write protection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page28_WP</name>
                     <description>Write protection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page29_WP</name>
                     <description>Write protection</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page30_WP</name>
                     <description>Write protection</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Page31_WP</name>
                     <description>Write protection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SKR</name>
               <displayName>SKR</displayName>
               <description>SRAM2 Key Register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>SRAM2 Key for software               erase</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>													
