bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G484xx.svd
         </registers>
     </peripheral>	    	  
	<peripheral>
         <name>VREFBUF</name>
         <description>Voltage reference buffer</description>
         <groupName>VREFBUF</groupName>
         <baseAddress>0x40010030</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x1D0</size>
            <usage>registers</usage>
         </addressBlock>	  
        <registers>			
            <register>
               <name>VREFBUF_CSR</name>
               <displayName>VREFBUF_CSR</displayName>
               <description>VREF_BUF Control and Status           Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>ENVR</name>
                     <description>Enable Voltage Reference</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HIZ</name>
                     <description>High impedence mode for the               VREF_BUF</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VRR</name>
                     <description>Voltage reference buffer ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>VRS</name>
                     <description>Voltage reference scale</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREFBUF_CCR</name>
               <displayName>VREFBUF_CCR</displayName>
               <description>VREF_BUF Calibration Control           Register</description>
               <addressOffset>0x04</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>Trimming code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
        </registers>	
    </peripheral>											
	<peripheral>
         <name>COMP</name>
         <description>Comparator control and status register</description>
         <groupName>COMP</groupName>
         <baseAddress>0x40010200</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
		 <interrupt>
            <name>COMP1_2_3</name>
            <description>COMP1_2_3</description>
            <value>64</value>
         </interrupt>
         <interrupt>
            <name>COMP4_5_6</name>
            <description>COMP4_5_6</description>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>COMP7</name>
            <description>COMP7</description>
            <value>66</value>
        </interrupt>		 	 
        <registers>
            <register>
               <name>COMP_C1CSR</name>
               <displayName>COMP_C1CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>						
            <register>
               <name>COMP_C2CSR</name>
               <displayName>COMP_C2CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>			
            <register>
               <name>COMP_C3CSR</name>
               <displayName>COMP_C3CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>			
            <register>
               <name>COMP_C4CSR</name>
               <displayName>COMP_C4CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x0C</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>			
            <register>
               <name>COMP_C5CSR</name>
               <displayName>COMP_C5CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>			
            <register>
               <name>COMP_C6CSR</name>
               <displayName>COMP_C6CSR</displayName>
               <description>Comparator control/status           register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INMSEL</name>
                     <description>INMSEL</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INPSEL</name>
                     <description>INPSEL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>POL</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>HYST</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BLANKSEL</name>
                     <description>BLANKSEL</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRGEN</name>
                     <description>BRGEN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SCALEN</name>
                     <description>SCALEN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>LOCK</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>			
