bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G484xx.svd
            <register>
               <name>RSTE2R</name>
               <displayName>RSTE2R</displayName>
               <description>Timerx Output2 Reset Register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UPDATE</name>
                     <description>UPDATE</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT10</name>
                     <description>EXTEVNT10</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT9</name>
                     <description>EXTEVNT9</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT8</name>
                     <description>EXTEVNT8</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT7</name>
                     <description>EXTEVNT7</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT6</name>
                     <description>EXTEVNT6</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT5</name>
                     <description>EXTEVNT5</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT4</name>
                     <description>EXTEVNT4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT3</name>
                     <description>EXTEVNT3</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT2</name>
                     <description>EXTEVNT2</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT1</name>
                     <description>EXTEVNT1</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT9</name>
                     <description>TIMEVNT9</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT8</name>
                     <description>TIMEVNT8</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT7</name>
                     <description>TIMEVNT7</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT6</name>
                     <description>TIMEVNT6</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT5</name>
                     <description>TIMEVNT5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT4</name>
                     <description>TIMEVNT4</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT3</name>
                     <description>TIMEVNT3</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT2</name>
                     <description>TIMEVNT2</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEVNT1</name>
                     <description>TIMEVNT1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP4</name>
                     <description>MSTCMP4</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP3</name>
                     <description>MSTCMP3</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP2</name>
                     <description>MSTCMP2</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP1</name>
                     <description>MSTCMP1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTPER</name>
                     <description>MSTPER</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP4</name>
                     <description>CMP4</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP3</name>
                     <description>CMP3</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP2</name>
                     <description>CMP2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1</name>
                     <description>CMP1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>PER</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RESYNC</name>
                     <description>RESYNC</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRT</name>
                     <description>SRT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EEFER1</name>
               <displayName>EEFER1</displayName>
               <description>Timerx External Event Filtering Register           1</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EE5FLTR</name>
                     <description>External Event 5 filter</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE5LTCH</name>
                     <description>External Event 5 latch</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE4FLTR</name>
                     <description>External Event 4 filter</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE4LTCH</name>
                     <description>External Event 4 latch</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE3FLTR</name>
                     <description>External Event 3 filter</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE3LTCH</name>
                     <description>External Event 3 latch</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE2FLTR</name>
                     <description>External Event 2 filter</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE2LTCH</name>
                     <description>External Event 2 latch</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE1FLTR</name>
                     <description>External Event 1 filter</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE1LTCH</name>
                     <description>External Event 1 latch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EEFER2</name>
               <displayName>EEFER2</displayName>
               <description>Timerx External Event Filtering Register           2</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EE10FLTR</name>
                     <description>External Event 10 filter</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE10LTCH</name>
                     <description>External Event 10 latch</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE9FLTR</name>
                     <description>External Event 9 filter</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE9LTCH</name>
                     <description>External Event 9 latch</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE8FLTR</name>
                     <description>External Event 8 filter</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE8LTCH</name>
                     <description>External Event 8 latch</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE7FLTR</name>
                     <description>External Event 7 filter</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE7LTCH</name>
                     <description>External Event 7 latch</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE6FLTR</name>
                     <description>External Event 6 filter</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE6LTCH</name>
                     <description>External Event 6 latch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSTER</name>
               <displayName>RSTER</displayName>
               <description>TimerA Reset Register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMFCPM2</name>
                     <description>Timer F Compare 2</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMDCMP4</name>
                     <description>Timer D Compare 4</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMDCMP2</name>
                     <description>Timer D Compare 2</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMDCMP1</name>
                     <description>Timer D Compare 1</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMCCMP4</name>
                     <description>Timer C Compare 4</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMCCMP2</name>
                     <description>Timer C Compare 2</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMCCMP1</name>
                     <description>Timer C Compare 1</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMBCMP4</name>
                     <description>Timer B Compare 4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMBCMP2</name>
                     <description>Timer B Compare 2</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMBCMP1</name>
                     <description>Timer B Compare 1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMACMP4</name>
                     <description>Timer A Compare 4</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMACMP2</name>
                     <description>Timer A Compare 2</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMACMP1</name>
                     <description>Timer A Compare 1</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT10</name>
                     <description>External Event 10</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT9</name>
                     <description>External Event 9</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT8</name>
                     <description>External Event 8</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT7</name>
                     <description>External Event 7</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT6</name>
                     <description>External Event 6</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT5</name>
                     <description>External Event 5</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT4</name>
                     <description>External Event 4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT3</name>
                     <description>External Event 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT2</name>
                     <description>External Event 2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEVNT1</name>
                     <description>External Event 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP4</name>
                     <description>Master compare 4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP3</name>
                     <description>Master compare 3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP2</name>
                     <description>Master compare 2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTCMP1</name>
                     <description>Master compare 1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTPER</name>
                     <description>Master timer Period</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP4</name>
                     <description>Timer A compare 4 reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP2</name>
                     <description>Timer A compare 2 reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDT</name>
                     <description>Timer A Update reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMFCMP1</name>
                     <description>Timer A Update reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHPER</name>
               <displayName>CHPER</displayName>
               <description>Timerx Chopper Register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STRTPW</name>
                     <description>STRTPW</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CHPDTY</name>
                     <description>Timerx chopper duty cycle               value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CHPFRQ</name>
                     <description>Timerx carrier frequency               value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
