bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G484xx.svd
            <register>
               <name>TIMECR2</name>
               <displayName>TIMECR2</displayName>
               <description>HRTIM Timerx Control Register           2</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRGHLF</name>
                     <description>Triggered-half mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GTCMP3</name>
                     <description>Greater than Compare 3 PWM               mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GTCMP1</name>
                     <description>Greater than Compare 1 PWM               mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEROM</name>
                     <description>Fault and Event Roll-Over               Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>BMROM</name>
                     <description>Burst Mode Roll-Over Mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ADROM</name>
                     <description>ADC Roll-Over Mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OUTROM</name>
                     <description>Output Roll-Over Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ROM</name>
                     <description>Roll-Over Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>UDM</name>
                     <description>Up-Down Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDR</name>
                     <description>Dual Channel DAC Reset               trigger</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDS</name>
                     <description>Dual Channel DAC Step               trigger</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDE</name>
                     <description>Dual Channel DAC trigger               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EEEFR3</name>
               <displayName>EEEFR3</displayName>
               <description>HRTIM Timerx External Event Filtering           Register 3</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EEVACNT</name>
                     <description>External Event A counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>EEVASEL</name>
                     <description>External Event A Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EEVARSTM</name>
                     <description>External Event A Reset               Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEVACRES</name>
                     <description>External Event A Counter               Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EEVACE</name>
                     <description>External Event A Counter               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>HRTIM_TIMF</name>
         <description>High Resolution Timer: TIMF</description>
         <groupName>HRTIM</groupName>
         <baseAddress>0x40016B00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x80</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HRTIM_TIME_IRQn</name>
            <description>HRTIM_TIME_IRQn</description>
            <value>72</value>
         </interrupt>
         <interrupt>
            <name>HRTIM_TIMF_IRQn</name>
            <description>HRTIM_TIMF_IRQn</description>
            <value>74</value>
         </interrupt>
         <registers>
            <register>
               <name>TIMFCR</name>
               <displayName>TIMFCR</displayName>
               <description>Timerx Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UPDGAT</name>
                     <description>Update Gating</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PREEN</name>
                     <description>Preload enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DACSYNC</name>
                     <description>AC Synchronization</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MSTU</name>
                     <description>Master Timer update</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDU</name>
                     <description>TDU</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCU</name>
                     <description>TCU</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBU</name>
                     <description>TBU</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAU</name>
                     <description>TAU</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TxRSTU</name>
                     <description>Timerx reset update</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TxREPU</name>
                     <description>Timer x Repetition update</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DELCMP4</name>
                     <description>Delayed CMP4 mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DELCMP2</name>
                     <description>Delayed CMP2 mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SYNCSTRTx</name>
                     <description>Synchronization Starts Timer               x</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCRSTx</name>
                     <description>Synchronization Resets Timer               x</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSYNCU</name>
                     <description>Re-Synchronized Update</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTLVD</name>
                     <description>Interleaved mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PSHPLL</name>
                     <description>Push-Pull mode enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HALF</name>
                     <description>Half mode enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RETRIG</name>
                     <description>Re-triggerable mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONT</name>
                     <description>Continuous mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CK_PSCx</name>
                     <description>HRTIM Timer x Clock               prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMFISR</name>
               <displayName>TIMFISR</displayName>
               <description>Timerx Interrupt Status           Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>O2CPY</name>
                     <description>Output 2 Copy</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>O1CPY</name>
                     <description>Output 1 Copy</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>O2STAT</name>
                     <description>Output 2 State</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>O1STAT</name>
                     <description>Output 1 State</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPPSTAT</name>
                     <description>Idle Push Pull Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPPSTAT</name>
                     <description>Current Push Pull Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLYPRT</name>
                     <description>Delayed Protection Flag</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST</name>
                     <description>Reset Interrupt Flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx2</name>
                     <description>Output 2 Reset Interrupt               Flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETx2</name>
                     <description>Output 2 Set Interrupt               Flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx1</name>
                     <description>Output 1 Reset Interrupt               Flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SETx1</name>
                     <description>Output 1 Set Interrupt               Flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT2</name>
                     <description>Capture2 Interrupt Flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT1</name>
                     <description>Capture1 Interrupt Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPD</name>
                     <description>Update Interrupt Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP</name>
                     <description>Repetition Interrupt Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP4</name>
                     <description>Compare 4 Interrupt Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP3</name>
                     <description>Compare 3 Interrupt Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP2</name>
                     <description>Compare 2 Interrupt Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1</name>
                     <description>Compare 1 Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMFICR</name>
               <displayName>TIMFICR</displayName>
               <description>Timerx Interrupt Clear           Register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DLYPRTC</name>
                     <description>Delayed Protection Flag               Clear</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTC</name>
                     <description>Reset Interrupt flag Clear</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx2C</name>
                     <description>Output 2 Reset flag Clear</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET2xC</name>
                     <description>Output 2 Set flag Clear</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTx1C</name>
                     <description>Output 1 Reset flag Clear</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET1xC</name>
                     <description>Output 1 Set flag Clear</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT2C</name>
                     <description>Capture2 Interrupt flag               Clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT1C</name>
                     <description>Capture1 Interrupt flag               Clear</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDC</name>
                     <description>Update Interrupt flag               Clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REPC</name>
                     <description>Repetition Interrupt flag               Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP4C</name>
                     <description>Compare 4 Interrupt flag               Clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP3C</name>
                     <description>Compare 3 Interrupt flag               Clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP2C</name>
                     <description>Compare 2 Interrupt flag               Clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP1C</name>
                     <description>Compare 1 Interrupt flag               Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
