bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G484xx.svd
            <register>
               <name>EECR1</name>
               <displayName>EECR1</displayName>
               <description>Timer External Event Control Register           1</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EE5FAST</name>
                     <description>External Event 5 Fast mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE5SNS</name>
                     <description>External Event 5               Sensitivity</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE5POL</name>
                     <description>External Event 5 Polarity</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE5SRC</name>
                     <description>External Event 5 Source</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE4FAST</name>
                     <description>External Event 4 Fast mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE4SNS</name>
                     <description>External Event 4               Sensitivity</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE4POL</name>
                     <description>External Event 4 Polarity</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE4SRC</name>
                     <description>External Event 4 Source</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE3FAST</name>
                     <description>External Event 3 Fast mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE3SNS</name>
                     <description>External Event 3               Sensitivity</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE3POL</name>
                     <description>External Event 3 Polarity</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE3SRC</name>
                     <description>External Event 3 Source</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE2FAST</name>
                     <description>External Event 2 Fast mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE2SNS</name>
                     <description>External Event 2               Sensitivity</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE2POL</name>
                     <description>External Event 2 Polarity</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE2SRC</name>
                     <description>External Event 2 Source</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE1FAST</name>
                     <description>External Event 1 Fast mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE1SNS</name>
                     <description>External Event 1               Sensitivity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE1POL</name>
                     <description>External Event 1 Polarity</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE1SRC</name>
                     <description>External Event 1 Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EECR2</name>
               <displayName>EECR2</displayName>
               <description>Timer External Event Control Register           2</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EE6SRC</name>
                     <description>EE6SRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE6POL</name>
                     <description>EE6POL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE6SNS</name>
                     <description>EE6SNS</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE7SRC</name>
                     <description>EE7SRC</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE7POL</name>
                     <description>EE7POL</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE7SNS</name>
                     <description>EE7SNS</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE8SRC</name>
                     <description>EE8SRC</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE8POL</name>
                     <description>EE8POL</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE8SNS</name>
                     <description>EE8SNS</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE9SRC</name>
                     <description>EE9SRC</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE9POL</name>
                     <description>EE9POL</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE9SNS</name>
                     <description>EE9SNS</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE10SRC</name>
                     <description>EE10SRC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EE10POL</name>
                     <description>EE10POL</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EE10SNS</name>
                     <description>EE10SNS</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EECR3</name>
               <displayName>EECR3</displayName>
               <description>Timer External Event Control Register           3</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EE6F</name>
                     <description>EE6F</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE7F</name>
                     <description>EE7F</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE8F</name>
                     <description>EE8F</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE9F</name>
                     <description>EE9F</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EE10F</name>
                     <description>EE10F</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EEVSD</name>
                     <description>EEVSD</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADC1R</name>
               <displayName>ADC1R</displayName>
               <description>ADC Trigger 1 Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AD1TEPER</name>
                     <description>ADC trigger 1 on Timer E               Period</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TEC4</name>
                     <description>ADC trigger 1 on Timer E compare               4</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TEC3</name>
                     <description>ADC trigger 1 on Timer E compare               3</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TEC2</name>
                     <description>ADC trigger 1 on Timer E compare               2</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TDPER</name>
                     <description>ADC trigger 1 on Timer D               Period</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TDC4</name>
                     <description>ADC trigger 1 on Timer D compare               4</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TDC3</name>
                     <description>ADC trigger 1 on Timer D compare               3</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TDC2</name>
                     <description>ADC trigger 1 on Timer D compare               2</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TCPER</name>
                     <description>ADC trigger 1 on Timer C               Period</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TCC4</name>
                     <description>ADC trigger 1 on Timer C compare               4</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TCC3</name>
                     <description>ADC trigger 1 on Timer C compare               3</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TCC2</name>
                     <description>ADC trigger 1 on Timer C compare               2</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TBRST</name>
                     <description>ADC trigger 1 on Timer B               Reset</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TBPER</name>
                     <description>ADC trigger 1 on Timer B               Period</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TBC4</name>
                     <description>ADC trigger 1 on Timer B compare               4</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TBC3</name>
                     <description>ADC trigger 1 on Timer B compare               3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TBC2</name>
                     <description>ADC trigger 1 on Timer B compare               2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TARST</name>
                     <description>ADC trigger 1 on Timer A               Reset</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TAPER</name>
                     <description>ADC trigger 1 on Timer A               Period</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TAC4</name>
                     <description>ADC trigger 1 on Timer A compare               4</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TAC3</name>
                     <description>ADC trigger 1 on Timer A compare               3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1TAC2</name>
                     <description>ADC trigger 1 on Timer A compare               2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1EEV5</name>
                     <description>ADC trigger 1 on External Event               5</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1EEV4</name>
                     <description>ADC trigger 1 on External Event               4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1EEV3</name>
                     <description>ADC trigger 1 on External Event               3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1EEV2</name>
                     <description>ADC trigger 1 on External Event               2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1EEV1</name>
                     <description>ADC trigger 1 on External Event               1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1MPER</name>
                     <description>ADC trigger 1 on Master               Period</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1MC4</name>
                     <description>ADC trigger 1 on Master Compare               4</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1MC3</name>
                     <description>ADC trigger 1 on Master Compare               3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1MC2</name>
                     <description>ADC trigger 1 on Master Compare               2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AD1MC1</name>
                     <description>ADC trigger 1 on Master Compare               1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
